STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/Applications/FileX/Fx_Nand_Write_Read_File/BSP/stm32mp13xx_valid_fmc_nand.c
/**
  ******************************************************************************
* @file    stm32mp13xx_valid_fmc_nand.c
* @author  MCD Application Team
* @brief   This file includes a standard driver for the MT29F8G08ABACA FMC
*          memory mounted on STM32MP13XX-VALID board.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_valid_fmc_nand.h"

/** @addtogroup BSP
* @{
*/

/** @addtogroup STM32MP13XX_VALID
* @{
*/

/** @defgroup STM32MP13XX_VALID_FMC STM32MP13XX_VALID_FMC
* @{
*/
/* Exported variables --------------------------------------------------------*/
/** @addtogroup STM32MP13XX_VALID_FMC_NAND_Exported_Variables FMC_NAND Exported Variables
* @{
*/
static NAND_HandleTypeDef hnand[NAND_INSTANCES_NBR];

#ifdef HAL_MDMA_MODULE_ENABLED

static MDMA_HandleTypeDef hdma_dataRead[NAND_INSTANCES_NBR];
static MDMA_HandleTypeDef hdma_dataWrite[NAND_INSTANCES_NBR];
static MDMA_HandleTypeDef hdma_eccRead[NAND_INSTANCES_NBR];
static uint32_t eccBuffer[NAND_INSTANCES_NBR][5  * (BSP_NAND_PAGE_SIZE / BSP_NAND_ECC_SECTOR_SIZE)];

#endif /* HAL_MDMA_MODULE_ENABLED  */

/** @defgroup STM32MP13XX_VALID_NOR_Private_Functions_Prototypes NOR Private Functions Prototypes
* @{
*/

/**
* @brief  Initializes the NAND device.
* @param  Instance  NAND Instance      
* @retval BSP status
*/
int32_t BSP_FMC_NAND_Init(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hnand[Instance].Instance  = FMC_NAND_DEVICE;
    
    /* __weak function can be rewritten by the application */
    if(MX_NAND_Init(&hnand[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_NO_INIT;
    }
  }
  
  return ret;
}

#ifdef HAL_MDMA_MODULE_ENABLED

/**
* @brief  Initializes the NAND device for use with the sequencer.
* @param  Instance  NAND Instance
* @retval BSP status
*/
int32_t BSP_FMC_NAND_InitWithSequencer(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    hnand[Instance].Instance  = FMC_NAND_DEVICE;

    /* __weak function can be rewritten by the application */
    if (MX_NAND_InitWithSequencer(
        &hnand[Instance],
        &hdma_dataRead[Instance],
        &hdma_dataWrite[Instance],
        &hdma_eccRead[Instance],
        eccBuffer[Instance]
        ) != HAL_OK)
    {
      ret = BSP_ERROR_NO_INIT;
    }
  }

  return ret;
}

#endif /* HAL_MDMA_MODULE_ENABLED  */

/**
* @brief  DeInitializes the NAND memory.
* @retval BSP status
*/
int32_t BSP_FMC_NAND_DeInit(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;;
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    /* NAND memory de-initialization */
    hnand[Instance].Instance = FMC_NAND_DEVICE;
    
#ifdef HAL_MDMA_MODULE_ENABLED
    if (HAL_NAND_Sequencer_DeInit(&hnand[Instance]) != HAL_OK)
    {
      return  HAL_ERROR;
    }
#endif /* HAL_MDMA_MODULE_ENABLED  */

    if(HAL_NAND_DeInit(&hnand[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Reads NAND flash IDs.
* @param  Instance  NAND Instance
* @param  pNAND_ID   Pointer to NAND ID structure
* @retval BSP status
*/
int32_t BSP_FMC_NAND_ReadID(uint32_t Instance, NAND_IDTypeDef *pNAND_ID)
{
  int32_t ret = BSP_ERROR_NONE;
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if(HAL_NAND_Read_ID(&hnand[Instance], pNAND_ID) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Reads current status of the NAND memory.
* @param  Instance  NAND Instance
* @retval NAND memory status: whether busy or not
*/
int32_t BSP_FMC_NAND_GetStatus(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  HAL_StatusTypeDef status;
  uint32_t nandStatus;
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    status = HAL_NAND_Read_Status(&hnand[Instance], &nandStatus);
    if (status != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else
    {
      switch (nandStatus)
      {
      case NAND_BUSY:
        ret = BSP_ERROR_BUSY;
        break;

      case NAND_ERROR:
        ret = BSP_ERROR_PERIPH_FAILURE;
        break;

      case NAND_READY:
        ret = BSP_ERROR_NONE;
        break;
      }
    }
  }
  
  return ret;
}

/**
* @brief  Erases the entire NAND chip.
* @param  Instance  NAND Instance
* @retval BSP status
*/
int32_t BSP_FMC_NAND_EraseChip(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;
  uint32_t i;
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else /*Erase all blocks*/
  {
    for (i = 0; i < hnand[Instance].Config.BlockNbr; i++)
    {
      Address.Block = i;
      
      if (HAL_NAND_Erase_Block(&hnand[Instance], &Address) != HAL_OK)
      {
        ret = BSP_ERROR_PERIPH_FAILURE;
      }
    }
  }
  
  return ret;
}

/**
* @brief  Erases the specified block of the NAND device.
* @param  Instance  NAND Instance
* @param  pAddress  pointer to BSP_NAND address structure
* @retval BSP status
*/

int32_t BSP_FMC_NAND_Erase_Block(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress)
{
  int32_t ret = BSP_ERROR_NONE;
  
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {  
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;
    
    if (HAL_NAND_Erase_Block(&hnand[Instance], &Address) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Read pages from the NAND device.
* @param  Instance       NAND Instance
* @param  pBuffer        pointer to destination read buffer
* @param  pAddress       pointer to BSP_NAND address structure
* @param  NumPageToRead  number of pages to read from block
* @retval BSP status
*/
int32_t BSP_FMC_NAND_Read(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumPageToRead)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;
    
    if (HAL_NAND_Read_Page_8b(&hnand[Instance], &Address, pBuffer, NumPageToRead) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Write pages to the NAND device.
* @param  Instance         NAND Instance
* @param  pAddress         pointer to BSP_NAND address structure
* @param  pBuffer          pointer to source buffer to write.
* @param  NumPageToWrite   number of pages to write to block
* @retval BSP status
*/
int32_t BSP_FMC_NAND_Write(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumPageToWrite)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;
    
    if (HAL_NAND_Write_Page_8b(&hnand[Instance], &Address, pBuffer, NumPageToWrite) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Read spare areas from the NAND device.
* @param  Instance             NAND Instance
* @param  pAddress             pointer to BSP_NAND address structure
* @param  pBuffer              pointer to source buffer to write. pBuffer should be 16bits aligned.
* @param  NumSpareAreaToRead   Number of spare area to read
* @retval HAL status
*/
int32_t  BSP_FMC_NAND_Read_SpareArea(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumSpareAreaToRead)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;
    
