STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/Applications/FileX/Fx_Nand_Write_Read_File/BSP/stm32mp13xx_valid_fmc_nand.c
    if (HAL_NAND_Read_SpareArea_8b(&hnand[Instance], &Address, pBuffer, NumSpareAreaToRead) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Write spare areas to the NAND device.
* @param  Instance              NAND Instance
* @param  pAddress              pointer to BSP_NAND address structure
* @param  pBuffer               pointer to source buffer to write
* @param  NumSpareAreaTowrite   number of spare areas to write to block
* @retval HAL status
*/
int32_t  BSP_FMC_NAND_Write_SpareArea(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumSpareAreaTowrite)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};
  
  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;
    
    if (HAL_NAND_Write_SpareArea_8b(&hnand[Instance], &Address, pBuffer, NumSpareAreaTowrite) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }
  
  return ret;
}

/**
* @brief  Read pages from the NAND device.
* @param  Instance       NAND Instance
* @param  pBuffer        pointer to destination read buffer
* @param  pAddress       pointer to BSP_NAND address structure
* @param  NumPageToRead  number of pages to read from block
* @param  NumPageRead    number of pages effectively read from block
* @retval BSP status
*/
int32_t BSP_FMC_NAND_ReadWithEcc(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumPageToRead, uint32_t *NumPageRead)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_ECC_Read_Page_8b(&hnand[Instance], &Address, pBuffer, NumPageToRead, NumPageRead) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
* @brief  Write pages to the NAND device.
* @param  Instance         NAND Instance
* @param  pAddress         pointer to BSP_NAND address structure
* @param  pBuffer          pointer to source buffer to write.
* @param  NumPageToWrite   number of pages to write to block
* @param  NumPageWritten   number of pages effectively written to block
* @retval BSP status
*/
int32_t BSP_FMC_NAND_WriteWithEcc(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer, uint32_t NumPageToWrite, uint32_t *NumPageWritten)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_ECC_Write_Page_8b(&hnand[Instance], &Address, pBuffer, NumPageToWrite, NumPageWritten) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

#ifdef HAL_MDMA_MODULE_ENABLED

/**
* @brief  Read one page from the NAND device using the sequencer.
* @param  Instance       NAND Instance
* @param  pBuffer        pointer to destination read buffer
* @param  pAddress       pointer to BSP_NAND address structure
* @retval BSP status
*/
int32_t BSP_FMC_NAND_ReadWithSequencer(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    #if !defined(NO_CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
    #endif

    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_Sequencer_Read_Page_8b(&hnand[Instance], &Address, pBuffer) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
* @brief  Write one page to the NAND device using the sequencer.
* @param  Instance         NAND Instance
* @param  pAddress         pointer to BSP_NAND address structure
* @param  pBuffer          pointer to source buffer to write.
* @retval BSP status
*/
int32_t BSP_FMC_NAND_WriteWithSequencer(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    #if !defined(NO_CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
    #endif

    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_Sequencer_Write_Page_8b(&hnand[Instance], &Address, pBuffer) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
* @brief  Read one page from the NAND device using the sequencer.
* @param  Instance       NAND Instance
* @param  pBuffer        pointer to destination read buffer
* @param  pAddress       pointer to BSP_NAND address structure
* @retval BSP status
*/
int32_t BSP_FMC_NAND_ReadWithSequencerAndEcc(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    #if !defined(NO_CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
    #endif

    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_Sequencer_ECC_Read_Page_8b(&hnand[Instance], &Address, pBuffer) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
* @brief  Write one page to the NAND device using the sequencer.
* @param  Instance         NAND Instance
* @param  pAddress         pointer to BSP_NAND address structure
* @param  pBuffer          pointer to source buffer to write.
* @retval BSP status
*/
int32_t BSP_FMC_NAND_WriteWithSequencerAndEcc(uint32_t Instance, BSP_NAND_AddressTypeDef_t *pAddress, uint8_t *pBuffer)
{
  int32_t ret = BSP_ERROR_NONE;
  NAND_AddressTypeDef Address = {0};

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    #if !defined(NO_CACHE_USE)
    L1C_CleanInvalidateDCacheAll();
    #endif

    Address.Block = pAddress->Block;
    Address.Page = pAddress->Page;

    if (HAL_NAND_Sequencer_ECC_Write_Page_8b(&hnand[Instance], &Address, pBuffer) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

/**
* @brief  Wait for the end of the last sequencer page read or write.
* @param  Instance         NAND Instance
* @retval BSP status
*/
int32_t BSP_FMC_NAND_WaitSequencerCompletion(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (HAL_NAND_Sequencer_WaitCompletion(&hnand[Instance], HAL_NAND_DEFAULT_SEQUENCER_TIMEOUT) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  return ret;
}

