STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/Applications/FileX/Fx_Nand_Write_Read_File/BSP/stm32mp13xx_valid_fmc_nand.c
int32_t BSP_FMC_NAND_GetEccStatistics(uint32_t Instance, NAND_EccStatisticsTypeDef *statistics)
{
  int32_t ret = BSP_ERROR_NONE;

  if(Instance >= NAND_INSTANCES_NBR)
  {
    ret =  BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    HAL_NAND_ECC_GetStatistics(&hnand[Instance], statistics);
  }

  return ret;
}

#endif /* HAL_MDMA_MODULE_ENABLED  */

static HAL_StatusTypeDef MX_NAND_InitCommon(NAND_HandleTypeDef *hNand)
{
  FMC_NAND_PCC_TimingTypeDef ComSpaceTiming = {0};
  FMC_NAND_PCC_TimingTypeDef AttSpaceTiming = {0};
  NAND_EccConfigTypeDef EccConfig = {0};
  
  /* Setup for MT29F8G08ABACA NAND device */

  /* hNand Init */
  hNand->Init.NandBank        = FMC_NAND_BANK3; /* Bank 3 is the only available with STM32MP135 */
  hNand->Init.Waitfeature     = FMC_NAND_WAIT_FEATURE_ENABLE; /* Waiting enabled when communicating with the NAND */
  hNand->Init.MemoryDataWidth = FMC_NAND_MEM_BUS_WIDTH_8; /* An 8-bit NAND is used */
  hNand->Init.EccComputation  = FMC_NAND_ECC_DISABLE; /* The HAL enable ECC computation when needed, keep it disabled at initialization */
  hNand->Init.EccAlgorithm    = BSP_NAND_ECC_ALGO; /* Hamming or BCH algorithm */
  hNand->Init.BCHMode         = BSP_NAND_ECC_BCH_MODE; /* BCH4 or BCH8 if BCH algorithm is used */
#if BSP_NAND_ECC_SECTOR_SIZE == 256
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_256BYTE;
#elif BSP_NAND_ECC_SECTOR_SIZE == 512
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_512BYTE; /* BCH works only with 512-byte sectors */
#elif BSP_NAND_ECC_SECTOR_SIZE == 1024
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_1024BYTE;
#elif BSP_NAND_ECC_SECTOR_SIZE == 2048
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_2048BYTE;
#elif BSP_NAND_ECC_SECTOR_SIZE == 4096
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_4096BYTE;
#elif BSP_NAND_ECC_SECTOR_SIZE == 8192
  hNand->Init.EccSectorSize   = FMC_NAND_ECC_SECTOR_SIZE_8192BYTE;
#else
#error "Unsupported ECC sector size"
#endif
  hNand->Init.TCLRSetupTime   = 2;
  hNand->Init.TARSetupTime    = 2;
  /* hNand Config */
  hNand->Config.PageSize = BSP_NAND_PAGE_SIZE;
  hNand->Config.SpareAreaSize = BSP_NAND_SPARE_AREA_SIZE;
  hNand->Config.BlockSize = BSP_NAND_BLOCK_SIZE;
  hNand->Config.BlockNbr = BSP_NAND_BLOCK_NBR;
  hNand->Config.PlaneSize = BSP_NAND_PLANE_SIZE;
  hNand->Config.PlaneNbr = BSP_NAND_PLANE_NBR;
  hNand->Config.ExtraCommandEnable = ENABLE;
  
  /* The following timings have been taken from UBOOT driver */

  /* ComSpaceTiming */
  ComSpaceTiming.SetupTime = 0x1;
  ComSpaceTiming.WaitSetupTime = 0x7;
  ComSpaceTiming.HoldSetupTime = 0x2;
  ComSpaceTiming.HiZSetupTime = 0x1;
  
  /* AttSpaceTiming */
  AttSpaceTiming.SetupTime = 0x1A;
  AttSpaceTiming.WaitSetupTime = 0x7;
  AttSpaceTiming.HoldSetupTime = 0x6A;
  AttSpaceTiming.HiZSetupTime = 0x1;
  
  /* Initialize NAND HAL */
  if (HAL_NAND_Init(hNand, &ComSpaceTiming, &AttSpaceTiming) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  /* Initialize NAND HAL ECC computations */
  EccConfig.Offset = BSP_NAND_ECC_OFFSET;
  if (HAL_NAND_ECC_Init(hNand, &EccConfig) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  return HAL_OK;
}

#ifdef HAL_MDMA_MODULE_ENABLED

/**
* @brief  Initializes the NAND peripheral.
* @param  hNand NAND handle
* @param  hDmaReadData DMA handle for reading data
* @param  hDmaWriteData DMA handle for writing data
* @param  hDmaReadEcc DMA handle for reading ECC
* @param  eccBuffer Buffer for reading the ECC
* @retval HAL status
*/
HAL_StatusTypeDef MX_NAND_InitWithSequencer(NAND_HandleTypeDef *hNand, MDMA_HandleTypeDef *hDmaReadData, MDMA_HandleTypeDef *hDmaWriteData, MDMA_HandleTypeDef *hDmaReadEcc, uint32_t *eccBuffer)
{
  NAND_SequencerConfigTypeDef SequencerConfig = {0};

  if (MX_NAND_InitCommon(hNand) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  /* Initialize NAND HAL sequencer */
  SequencerConfig.HdmaRead = hDmaReadData;
  SequencerConfig.HdmaWrite = hDmaWriteData;
  SequencerConfig.HdmaReadEcc = hDmaReadEcc;
  SequencerConfig.EccBuffer = eccBuffer;
  if (HAL_NAND_Sequencer_Init(hNand, &SequencerConfig) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  /* Reset NAND device */
  if (HAL_NAND_Reset(hNand) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  return HAL_OK;
}

#endif /* HAL_MDMA_MODULE_ENABLED  */

/**
* @brief  Initializes the NAND peripheral.
* @param  hNand NAND handle
* @retval HAL status
*/
__weak HAL_StatusTypeDef MX_NAND_Init(NAND_HandleTypeDef *hNand)
{
  if (MX_NAND_InitCommon(hNand) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  /* Reset NAND device */
  if (HAL_NAND_Reset(hNand) != HAL_OK)
  {
    return  HAL_ERROR;
  }

  return HAL_OK;
}

/** @defgroup STM32MP13XX_VALID_NAND_Private_Functions NAND Private Functions
* @{
*/

static inline void SetupGPIO(GPIO_TypeDef *Gpio, GPIO_InitTypeDef *Init, uint32_t Pin)
{
  /* Setup GPIO options */
  Init->Pin = Pin;
  HAL_GPIO_Init(Gpio, Init);
  /* Unsecure GPIO */
  Gpio->SECCFGR &= ~Pin;
}

/**
* @brief  Initializes the NAND MSP.
* @param  hnand NAND handle
* @retval None
*/
void HAL_NAND_MspInit(NAND_HandleTypeDef *hnand)
{
  GPIO_InitTypeDef GPIO_Init_Structure;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(hnand);

  /* Enable FMC clock */
  __HAL_RCC_FMC_CLK_ENABLE();
  
  __HAL_RCC_FMC_FORCE_RESET();
  __HAL_RCC_FMC_RELEASE_RESET();

  /* Enable MDMA controller clock */
  __HAL_RCC_MDMA_CLK_ENABLE();

  /* Enable GPIOs clock */
__HAL_RCC_GPIOA_CLK_ENABLE();
__HAL_RCC_GPIOB_CLK_ENABLE();
__HAL_RCC_GPIOD_CLK_ENABLE();
__HAL_RCC_GPIOE_CLK_ENABLE();
__HAL_RCC_GPIOG_CLK_ENABLE();
  
  /* Common GPIO configuration */
  GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
  GPIO_Init_Structure.Pull      = GPIO_PULLUP;
  GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  
  /* STM32MP135 pins: */
  GPIO_Init_Structure.Alternate = GPIO_AF10_QUADSPI; // FIXME: Should be GPIO_AF10_FMC but not defined and same value anyway
  SetupGPIO(GPIOA, &GPIO_Init_Structure, GPIO_PIN_9); /* FMC_NWAIT: PA9 */
  GPIO_Init_Structure.Alternate = GPIO_AF12_FMC;
  SetupGPIO(GPIOG, &GPIO_Init_Structure, GPIO_PIN_9); /* FMC_NCE: PG9 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_4); /* FMC_NOE: PD4 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_5); /* FMC_NWE: PD5 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_12); /* FMC_ALE: PD12 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_11); /* FMC_CLE: PD11 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_14); /* FMC_D0: PD14 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_15); /* FMC_D1: PD15 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_0); /* FMC_D2: PD0 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_1); /* FMC_D3: PD1 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_7); /* FMC_D4: PE7 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_8); /* FMC_D5: PE8 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_9); /* FMC_D6: PE9 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_10); /* FMC_D7: PE10 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_11); /* FMC_D8: PE11 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_12); /* FMC_D9: PE12 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_13); /* FMC_D10: PE13 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_14); /* FMC_D11: PE14 */
  SetupGPIO(GPIOE, &GPIO_Init_Structure, GPIO_PIN_15); /* FMC_D12: PE15 */
  SetupGPIO(GPIOB, &GPIO_Init_Structure, GPIO_PIN_8); /* FMC_D13: PB8 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_9); /* FMC_D14: PD9 */
  SetupGPIO(GPIOD, &GPIO_Init_Structure, GPIO_PIN_10); /* FMC_D15: PD10 */

  /* Enable and set interrupt to the lowest priority */
  IRQ_SetPriority(FMC_IRQn, 0x0F);
  IRQ_Enable(FMC_IRQn);
}

/**
* @brief  DeInitializes NAND MSP.
* @param  hnand NAND handle
* @retval None
*/
void HAL_NAND_MspDeInit(NAND_HandleTypeDef *hnand)
{
  IRQ_Disable(FMC_IRQn);

  __HAL_RCC_FMC_FORCE_RESET();
  __HAL_RCC_FMC_RELEASE_RESET();

  __HAL_RCC_MDMA_CLK_DISABLE();

  HAL_GPIO_DeInit(GPIOG, GPIO_PIN_9);
  HAL_GPIO_DeInit(GPIOA, GPIO_PIN_9);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_4);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_5);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_12);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_11);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_14);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_15);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_0);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_1);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_7);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_8);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_9);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_10);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_11);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_12);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_13);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_14);
  HAL_GPIO_DeInit(GPIOE, GPIO_PIN_15);
  HAL_GPIO_DeInit(GPIOB, GPIO_PIN_8);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_9);
  HAL_GPIO_DeInit(GPIOD, GPIO_PIN_10);

  __HAL_RCC_GPIOA_CLK_DISABLE();
  __HAL_RCC_GPIOB_CLK_DISABLE();
  __HAL_RCC_GPIOD_CLK_DISABLE();
  __HAL_RCC_GPIOE_CLK_DISABLE();
  __HAL_RCC_GPIOG_CLK_DISABLE();
}

