STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/Applications/FileX/Fx_Nand_Write_Read_File/BSP/stm32mp13xx_valid_fmc_nand.c
#ifdef HAL_MDMA_MODULE_ENABLED

#define MDMA_BUFFER_TRANSFER_LENGTH_MAX 128

HAL_StatusTypeDef HAL_NAND_Sequencer_MspInit(NAND_HandleTypeDef *hnand)
{
  HAL_StatusTypeDef status;
  MDMA_HandleTypeDef *hdma;
  uint32_t eccSizePerSector = HAL_NAND_Sequencer_GetEccWordsPerSector(hnand) * 4;

  hdma = hnand->SequencerConfig.HdmaRead;
  hdma->Instance = MDMA_Channel0;
  hdma->Init.Request = MDMA_REQUEST_FMC_DATA;
  hdma->Init.TransferTriggerMode = MDMA_BLOCK_TRANSFER;
  hdma->Init.Priority = MDMA_PRIORITY_VERY_HIGH;
  hdma->Init.SecureMode = MDMA_SECURE_MODE_DISABLE;
  hdma->Init.Endianness = MDMA_LITTLE_ENDIANNESS_PRESERVE;
  hdma->Init.SourceInc = MDMA_SRC_INC_DISABLE;
  hdma->Init.DestinationInc = MDMA_DEST_INC_WORD;
  hdma->Init.SourceDataSize = MDMA_SRC_DATASIZE_WORD;
  hdma->Init.DestDataSize = MDMA_DEST_DATASIZE_WORD;
  hdma->Init.DataAlignment = MDMA_DATAALIGN_RIGHT;
  hdma->Init.BufferTransferLength = MDMA_BUFFER_TRANSFER_LENGTH_MAX;
  hdma->Init.SourceBurst = MDMA_SOURCE_BURST_32BEATS;
  hdma->Init.DestBurst = MDMA_DEST_BURST_32BEATS;
  hdma->Init.SourceBlockAddressOffset = 0;
  hdma->Init.DestBlockAddressOffset = 0;
  status = HAL_MDMA_Init(hdma);
  if (status != HAL_OK)
  {
    return status;
  }

  hdma = hnand->SequencerConfig.HdmaWrite;
  hdma->Instance = MDMA_Channel1;
  hdma->Init.Request = MDMA_REQUEST_FMC_DATA;
  hdma->Init.TransferTriggerMode = MDMA_BLOCK_TRANSFER;
  hdma->Init.Priority = MDMA_PRIORITY_VERY_HIGH;
  hdma->Init.SecureMode = MDMA_SECURE_MODE_DISABLE;
  hdma->Init.Endianness = MDMA_LITTLE_ENDIANNESS_PRESERVE;
  hdma->Init.SourceInc = MDMA_SRC_INC_WORD;
  hdma->Init.DestinationInc = MDMA_DEST_INC_DISABLE;
  hdma->Init.SourceDataSize = MDMA_SRC_DATASIZE_WORD;
  hdma->Init.DestDataSize = MDMA_DEST_DATASIZE_WORD;
  hdma->Init.DataAlignment = MDMA_DATAALIGN_RIGHT;
  hdma->Init.BufferTransferLength = MDMA_BUFFER_TRANSFER_LENGTH_MAX;
  hdma->Init.SourceBurst = MDMA_SOURCE_BURST_32BEATS;
  hdma->Init.DestBurst = MDMA_DEST_BURST_32BEATS;
  hdma->Init.SourceBlockAddressOffset = 0;
  hdma->Init.DestBlockAddressOffset = 0;
  status = HAL_MDMA_Init(hdma);
  if (status != HAL_OK)
  {
    return status;
  }

  hdma = hnand->SequencerConfig.HdmaReadEcc;
  hdma->Instance = MDMA_Channel2;
  hdma->Init.Request = MDMA_REQUEST_FMC_ERROR;
  hdma->Init.TransferTriggerMode = MDMA_BLOCK_TRANSFER;
  hdma->Init.Priority = MDMA_PRIORITY_VERY_HIGH;
  hdma->Init.SecureMode = MDMA_SECURE_MODE_DISABLE;
  hdma->Init.Endianness = MDMA_LITTLE_ENDIANNESS_PRESERVE;
  hdma->Init.SourceInc = MDMA_SRC_INC_WORD;
  hdma->Init.DestinationInc = MDMA_DEST_INC_WORD;
  hdma->Init.SourceDataSize = MDMA_SRC_DATASIZE_WORD;
  hdma->Init.DestDataSize = MDMA_DEST_DATASIZE_WORD;
  hdma->Init.DataAlignment = MDMA_DATAALIGN_RIGHT;
  hdma->Init.BufferTransferLength = eccSizePerSector;
  hdma->Init.SourceBurst = MDMA_SOURCE_BURST_SINGLE;
  hdma->Init.DestBurst = MDMA_DEST_BURST_SINGLE;
  hdma->Init.SourceBlockAddressOffset = -eccSizePerSector;
  hdma->Init.DestBlockAddressOffset = 0;
  status = HAL_MDMA_Init(hdma);
  if (status != HAL_OK)
  {
    return status;
  }

  return HAL_OK;
}

void HAL_NAND_Sequencer_MspDeInit(NAND_HandleTypeDef *hnand)
{
  HAL_MDMA_DeInit(hnand->SequencerConfig.HdmaRead);
  HAL_MDMA_DeInit(hnand->SequencerConfig.HdmaWrite);
  HAL_MDMA_DeInit(hnand->SequencerConfig.HdmaReadEcc);
}

#endif /* HAL_MDMA_MODULE_ENABLED  */
